gradhocJcalvo/optee-graddeck/core/arch/arm/plat-stm32mp1/scmi_server.c
	if (res)
		return SCMI_HARDWARE_ERROR;

	return SCMI_SUCCESS;
}

#ifndef CFG_SCMI_MSG_REGULATOR_CONSUMER
/*
 * Platform SCMI voltage domains
 */
static struct stm32_scmi_voltd *find_voltd(unsigned int channel_id,
					   unsigned int scmi_id)
{
	const struct channel_resources *resource = find_resource(channel_id);
	size_t n = 0;

	if (resource) {
		for (n = 0; n < resource->voltd_count; n++)
			if (n == scmi_id)
				return &resource->voltd[n];
	}

	return NULL;
}

size_t plat_scmi_voltd_count(unsigned int channel_id)
{
	const struct channel_resources *resource = find_resource(channel_id);

	if (!resource)
		return 0;

	return resource->voltd_count;
}

const char *plat_scmi_voltd_get_name(unsigned int channel_id,
				     unsigned int scmi_id)
{
	struct stm32_scmi_voltd *voltd = find_voltd(channel_id, scmi_id);

	/* Currently non-secure is allowed to access all PWR regulators */
	if (!voltd)
		return NULL;

	return voltd->name;
}

int32_t plat_scmi_voltd_levels_array(unsigned int channel_id,
				     unsigned int scmi_id, size_t start_index,
				     long *out_levels, size_t *nb_elts)

{
	struct stm32_scmi_voltd *voltd = find_voltd(channel_id, scmi_id);

	if (!voltd)
		return SCMI_NOT_FOUND;

	if (voltd->regulator) {
		struct regulator_voltages_desc *desc = NULL;
		TEE_Result res = TEE_ERROR_GENERIC;
		const int *levels = NULL;
		size_t n = 0;

		res = regulator_supported_voltages(voltd->regulator, &desc,
						   &levels);
		if (res == TEE_ERROR_NOT_SUPPORTED)
			return SCMI_NOT_SUPPORTED;
		if (res)
			return SCMI_GENERIC_ERROR;
		if (!desc || desc->type != VOLTAGE_TYPE_FULL_LIST) {
			/*
			 * Triplet min/max/step description. Caller should use
			 * plat_scmi_voltd_levels_by_step().
			 */
			return SCMI_NOT_SUPPORTED;
		}

		if (start_index >= desc->num_levels)
			return SCMI_OUT_OF_RANGE;

		if (!*nb_elts) {
			*nb_elts = desc->num_levels - start_index;
			return SCMI_SUCCESS;
		}

		*nb_elts = MIN(*nb_elts, desc->num_levels - start_index);
		for (n = 0; n < *nb_elts; n++)
			out_levels[n] = levels[start_index + n];

		return SCMI_SUCCESS;
	}

	return SCMI_DENIED;
}

int32_t plat_scmi_voltd_levels_by_step(unsigned int channel_id,
				       unsigned int scmi_id, long *min_max_step)
{
	struct stm32_scmi_voltd *voltd = find_voltd(channel_id, scmi_id);

	if (!voltd)
		return SCMI_NOT_FOUND;

	if (voltd->regulator) {
		struct regulator_voltages_desc *desc = NULL;
		TEE_Result res = TEE_ERROR_GENERIC;
		const int *levels = NULL;

		res = regulator_supported_voltages(voltd->regulator, &desc,
						   &levels);
		if (res == TEE_ERROR_NOT_SUPPORTED)
			return SCMI_NOT_SUPPORTED;
		if (res)
			return SCMI_GENERIC_ERROR;
		if (!desc || desc->type != VOLTAGE_TYPE_INCREMENT) {
			/*
			 * Triplet min/max/step description. Caller should use
			 * plat_scmi_voltd_levels_by_step().
			 */
			return SCMI_NOT_SUPPORTED;
		}

		min_max_step[0] = levels[0];
		min_max_step[1] = levels[1];
		min_max_step[2] = levels[2];

		return SCMI_SUCCESS;
	}

	return SCMI_NOT_SUPPORTED;
}

int32_t plat_scmi_voltd_get_level(unsigned int channel_id, unsigned int scmi_id,
				  long *level_uv)
{
	struct stm32_scmi_voltd *voltd = find_voltd(channel_id, scmi_id);

	if (!voltd)
		return SCMI_INVALID_PARAMETERS;

	if (voltd->regulator) {
		*level_uv = regulator_get_voltage(voltd->regulator);
		return SCMI_SUCCESS;
	}

	return SCMI_DENIED;
}

int32_t plat_scmi_voltd_set_level(unsigned int channel_id, unsigned int scmi_id,
				  long level_uv)
{
	struct stm32_scmi_voltd *voltd = find_voltd(channel_id, scmi_id);

	if (!voltd)
		return SCMI_NOT_FOUND;

	if (voltd->regulator) {
		TEE_Result res = TEE_ERROR_GENERIC;

		if (level_uv < INT_MIN || level_uv > INT_MAX)
			return SCMI_OUT_OF_RANGE;

		res = regulator_set_voltage(voltd->regulator, level_uv);
		if (res)
			return SCMI_GENERIC_ERROR;
		else
			return SCMI_SUCCESS;
	}

	return SCMI_DENIED;
}

int32_t plat_scmi_voltd_get_config(unsigned int channel_id,
				   unsigned int scmi_id, uint32_t *config)
{
	struct stm32_scmi_voltd *voltd = find_voltd(channel_id, scmi_id);

	if (!voltd)
		return SCMI_NOT_FOUND;

	if (voltd->regulator) {
		if (voltd->state)
			*config = SCMI_VOLTAGE_DOMAIN_CONFIG_ARCH_ON;
		else
			*config = SCMI_VOLTAGE_DOMAIN_CONFIG_ARCH_OFF;

		return SCMI_SUCCESS;
	}

	return SCMI_DENIED;
}

int32_t plat_scmi_voltd_set_config(unsigned int channel_id,
				   unsigned int scmi_id, uint32_t config)
{
	struct stm32_scmi_voltd *voltd = find_voltd(channel_id, scmi_id);

	if (!voltd)
		return SCMI_NOT_FOUND;

	if (voltd->regulator) {
		switch (config) {
		case SCMI_VOLTAGE_DOMAIN_CONFIG_ARCH_ON:
			if (!voltd->state) {
				if (regulator_enable(voltd->regulator))
					return SCMI_GENERIC_ERROR;

				voltd->state = true;
			}
			break;
		case SCMI_VOLTAGE_DOMAIN_CONFIG_ARCH_OFF:
			if (voltd->state) {
				if (regulator_disable(voltd->regulator))
					return SCMI_GENERIC_ERROR;

				voltd->state = false;
			}
			break;
		default:
			return SCMI_INVALID_PARAMETERS;
		}

		return SCMI_SUCCESS;
	}

	return SCMI_DENIED;
}

static void get_voltd_regulator(struct stm32_scmi_voltd *voltd)
{
	switch (voltd->priv_dev) {
	case VOLTD_PWR:
		voltd->regulator = stm32mp1_pwr_get_regulator(voltd->priv_id);
		break;
	case VOLTD_PMIC:
		voltd->regulator = stm32mp_pmic_get_regulator(voltd->priv_name);
		break;
	case VOLTD_VREFBUF:
		voltd->regulator = stm32_vrefbuf_regulator();
		break;
	case VOLTD_IOD:
		voltd->regulator = stm32mp1_get_iod_regulator(voltd->priv_id);
		break;
	default:
		break;
	}

	if (voltd->regulator && voltd->regulator->flags & REGULATOR_BOOT_ON)
		regulator_enable(voltd->regulator);
}
#else
static void __noreturn get_voltd_regulator(struct stm32_scmi_voltd *v __unused)
{
	panic();
}
#endif /*CFG_SCMI_MSG_REGULATOR_CONSUMER*/

/*
 * Initialize platform SCMI resources
 */
static TEE_Result stm32mp1_init_scmi_server(void)
{
	size_t i = 0;
	size_t j = 0;

	for (i = 0; i < ARRAY_SIZE(scmi_channel); i++) {
		const struct channel_resources *res = scmi_channel + i;
		struct scmi_msg_channel *chan = res->channel;

		if (chan->shm_addr.pa) {
			struct io_pa_va *addr = &chan->shm_addr;

			/* Enforce non-secure shm mapped as device memory */
			addr->va = (vaddr_t)phys_to_virt(addr->pa,
							 MEM_AREA_IO_NSEC,
							 chan->shm_size);
			assert(addr->va);

			scmi_smt_init_agent_channel(chan);
		}

		for (j = 0; j < res->clock_count; j++) {
			struct stm32_scmi_clk *clk = &res->clock[j];

			if (!clk->name ||
			    strlen(clk->name) >= SCMI_CLOCK_NAME_SIZE)
				panic("SCMI clock name invalid");

			clk->clk = stm32mp_rcc_clock_id_to_clk(clk->clock_id);
			assert(clk->clk);

			/* Sync SCMI clocks with their targeted initial state */
			if (clk->enabled &&
			    stm32mp_nsec_can_access_clock(clk->clock_id))
				clk_enable(clk->clk);
		}

		for (j = 0; j < res->rd_count; j++) {
			struct stm32_scmi_rd *rd = &res->rd[j];
			struct rstctrl *rstctrl = NULL;

			if (!rd->name ||
			    strlen(rd->name) >= SCMI_RD_NAME_SIZE)
				panic("SCMI reset domain name invalid");

			rstctrl = stm32mp_rcc_reset_id_to_rstctrl(rd->reset_id);
			assert(rstctrl);

			rd->rstctrl = rstctrl;
		}


		if (!IS_ENABLED(CFG_SCMI_MSG_REGULATOR_CONSUMER)) {
			for (j = 0; j < res->voltd_count; j++) {
				struct stm32_scmi_voltd *voltd = &res->voltd[j];

				if (!voltd->name ||
				    strlen(voltd->name) >= SCMI_VOLTD_NAME_SIZE)
					panic("SCMI voltage domain name invalid");

				get_voltd_regulator(voltd);
			}
		}
	}

	return TEE_SUCCESS;
}

driver_init_late(stm32mp1_init_scmi_server);
